Tekla.Structures.Extensions.ExtensionStarterHelper
Provides utility methods to assist with initializing and managing extension-based functionality.
Remarks: This class is intended to serve as a helper for working with extensions. It contains static
methods that simplify common tasks related to extension initialization or management.

Tekla.Structures.Extensions.ExtensionStarterHelper.LaunchTool(System.String,System.String)
Launches an external tool with the specified executable name and optional arguments.
Remarks: This method starts the specified tool as a separate process. If the tool fails to
launch, an error is logged, and the exception is rethrown.
toolExeName: The name of the executable file for the tool to launch. This must include the file extension (e.g., ".exe").
args: Optional command-line arguments to pass to the tool. If not specified, no arguments are passed.